<?php

/*
Консольное приложение с composer

    Установите composer на вашем сервере, и создайте простое консольное приложение на основе компонента Symfony/Console.
    Создайте в этом приложении одну команду, принимающую один аргумент - исходная строка и одну опцию - порядок преобразования.
    Команда должна преобразовывать строки где каждый нечетный - символ заглавная буква, а каждый четный - прописная, например: This is my string должно преобразоваться в tHiS Is My StRiNg
    Если команде передана опция - то порядок заглавных и прописных букв должен поменяться: четный - символ заглавная буква, а каждый нечетный - прописная.
*/

require_once __DIR__.DIRECTORY_SEPARATOR.'vendor'.DIRECTORY_SEPARATOR.'autoload.php';

$app = new \Symfony\Component\Console\Application('mOuNt nOtAtIoN');

$app->add(new App\MountNotationCommand());

$app->run();
